[
    {
      "id": 14354195,
      "title": "Sandwich Artist",
      "summary": "A Subway® Sandwich Artist ™ is the face of our Franchisees’ stores. As well as preparing and serving delicious Subway® sandwiches you will meet and greet guests and deliver exceptional customer service. You’ll be the reason customers keep coming back Working as a Sandwich Artist ™ in a Subway® franchise is a challenging role but one that is highly rewarding. Subway® Franchisees are proud of their hard working staff and are able to offer fantastic career path opportunities to truly develop a career into supervisory and managerial roles. Food preparation including bread and cookie baking Ensure food storage and preparation areas are maintained according to Health & Safety and Audit standards Comply with Food Code of Practice Till Operator Monitoring stock levels Checking in deliveries Complete daily and weekly cleaning schedules Follow security & safety procedures Maintain a safe working environment for employees and customers Maintain high personal presentation in the provided uniform to meet the Subway® brand and customer expectations Work as a team member Deliver a high standard of service when dealing with products, sales and catering for customer needs. As a Sandwich Artist ™ you will serve and add value to customer needs in an efficient and friendly manner. In this role you will promote Subway® brand awareness and ensure hygiene standards are met. Previous experience in food preparation, retail sales and/or customer service is desirable but not essential because you will receive full training and undertake various University of Subway® courses. What’s more important is a winning attitude. If you’re currently working in retail or in a restaurant, perhaps you are studying and are looking to start a career in the food industry. This could be the perfect opportunity for you",
      "company": "Subway",
      "activedate": {
        "start": "2024-04-17T06:54:00Z",
        "end": "2024-05-17T06:54:00Z"
      },
      "location": {
        "location": "Santry Dublin, D9",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354195"
    },
    {
      "id": 14354196,
      "title": "Sandwich Artist",
      "summary": "A Subway® Sandwich Artist ™ is the face of our Franchisees’ stores. As well as preparing and serving delicious Subway® sandwiches you will meet and greet guests and deliver exceptional customer service. You’ll be the reason customers keep coming back Working as a Sandwich Artist ™ in a Subway® franchise is a challenging role but one that is highly rewarding. Subway® Franchisees are proud of their hard working staff and are able to offer fantastic career path opportunities to truly develop a career into supervisory and managerial roles. Food preparation including bread and cookie baking Ensure food storage and preparation areas are maintained according to Health & Safety and Audit standards Comply with Food Code of Practice Till Operator Monitoring stock levels Checking in deliveries Complete daily and weekly cleaning schedules Follow security & safety procedures Maintain a safe working environment for employees and customers Maintain high personal presentation in the provided uniform to meet the Subway® brand and customer expectations Work as a team member Deliver a high standard of service when dealing with products, sales and catering for customer needs. As a Sandwich Artist ™ you will serve and add value to customer needs in an efficient and friendly manner. In this role you will promote Subway® brand awareness and ensure hygiene standards are met. Previous experience in food preparation, retail sales and/or customer service is desirable but not essential because you will receive full training and undertake various University of Subway® courses. What’s more important is a winning attitude. If you’re currently working in retail or in a restaurant, perhaps you are studying and are looking to start a career in the food industry. This could be the perfect opportunity for you",
      "company": "Subway",
      "activedate": {
        "start": "2024-04-17T06:54:00Z",
        "end": "2024-05-17T06:54:00Z"
      },
      "location": {
        "location": "Unit 3B Basingstoke, RG21 7AW",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354196"
    },
    {
      "id": 14354197,
      "title": "Sandwich Artist",
      "summary": "A Subway® Sandwich Artist ™ is the face of our Franchisees’ stores. As well as preparing and serving delicious Subway® sandwiches you will meet and greet guests and deliver exceptional customer service. You’ll be the reason customers keep coming back Working as a Sandwich Artist ™ in a Subway® franchise is a challenging role but one that is highly rewarding. Subway® Franchisees are proud of their hard working staff and are able to offer fantastic career path opportunities to truly develop a career into supervisory and managerial roles. Food preparation including bread and cookie baking Ensure food storage and preparation areas are maintained according to Health & Safety and Audit standards Comply with Food Code of Practice Till Operator Monitoring stock levels Checking in deliveries Complete daily and weekly cleaning schedules Follow security & safety procedures Maintain a safe working environment for employees and customers Maintain high personal presentation in the provided uniform to meet the Subway® brand and customer expectations Work as a team member Deliver a high standard of service when dealing with products, sales and catering for customer needs. As a Sandwich Artist ™ you will serve and add value to customer needs in an efficient and friendly manner. In this role you will promote Subway® brand awareness and ensure hygiene standards are met. Previous experience in food preparation, retail sales and/or customer service is desirable but not essential because you will receive full training and undertake various University of Subway® courses. What’s more important is a winning attitude. If you’re currently working in retail or in a restaurant, perhaps you are studying and are looking to start a career in the food industry. This could be the perfect opportunity for you",
      "company": "Subway",
      "activedate": {
        "start": "2024-04-17T06:54:00Z",
        "end": "2024-05-17T06:54:00Z"
      },
      "location": {
        "location": "White Rose Retail Centre Doncaster, DN4 5FT",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354197"
    },
    {
      "id": 13746883,
      "title": "Personal Care Assistant for a teenage boy P/T £13.09/hr in Choppington - FTE - £25.5k",
      "summary": "Personal Care Assistant for a teenage boy P/T £13.09/hr in Choppington - FTE - £25.5k Apply at UKCIL.com. Reference: 4d8dee14 We are looking to recruit a person to complement our team of workers, to support a young boy who has a diagnosis of Autism, Learning Disability and ADHD The young boy is a happy child who loves animals and enjoys watching a range of cartoons including Mickey Mouse Clubhouse as well as being active. He smiles a lot although he can be loud when he is distressed. He sensory seeks and may head bang into people when distressed. He can become distressed when he finally realises, he is hungry, thirsty or cold but may not realise this and refuse food and drink until he is very hungry or thirsty. Waiting can cause him to become distressed. He has weighted items and chew noodles to help provide feedback to keep him regulated. Changes to routine can distress him His favourite activities are visiting places like Plessey Woods, soft play, swimming, beaches, walks where he can feed the ducks etc. he has a National Trust card, Tim Lamb membership, Alan Shearer Centre membership and Beamish membership. He also likes going out in his chair, likes messy play but usually wants his hands cleaned fairly quickly after the messy play. He also enjoys trips to McDonalds, going into shops to buy one item (this is often a packet of noodles or sweets). To support 2-1 for 5 hours a week during summer school holidays (6 Weeks), usually on a weekday. While being part of a team with picking up additional hours during staff holiday and/or sick leave if possible Time out to be used to access age-appropriate activities away from the home, support with medication and build a secure relationship with the young boy and his family. To encourage interactions, appropriate to the activities being accessed, while supporting and prompting the young boy with toileting needs/ hygiene. Essential Criteria · Have a high degree of initiative. · Be punctual and reliable. · Be flexible. · Have a happy positive caring nature. · Have an outgoing personality. Rates of pay £13.09 per hour and 5.6 weeks holiday (pro rata) Out of pocket expenses will be met by the Employer. This post is subject to a satisfactory Enhanced DBS check and references (Cost to be met by Employer). Car driver is essential and must have Business Insurance. Please discuss other available hours with employer. Hours: 5hrs per week during school's summer holidays (6 weeks). Day and time to be discussed at interview. Key Responsibilities Services Personal Care Social  Leisure activities Support to remain independent Training Safeguarding Adults/Children Moving & Handling Understanding challenging behaviour Food Hygiene First Aid Hand hygiene Autism / Aspergers Transportation Full UK driving license Own personal car Medical Safe Administration of Medication Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "CHOPPINGTON, NE62",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/13746883"
    },
    {
      "id": 13397161,
      "title": "Personal Care Assistant for a gentleman P/T £13.09/hr in Blyth - FTE - £25.5k",
      "summary": "Personal Care Assistant for a gentleman P/T £13.09/hr in Blyth - FTE - £25.5k Apply at UKCIL.com. Reference: b41b6275 A gentleman in the Blyth area is looking to recruit some carers to support him within the family home. The gentleman has several health issues but is most restricted by his mobility The gentleman is looking for carers who are easy going and are able to promote his confidence, independence and self-esteem. The gentleman enjoys videos and computers Hours of work: 5.5.hrs a week Am and evening call Days and times to be discussed at interview Rates of Pay: £13.09 per hour Location: Blyth area Main Duties: To support with some personal care if/when necessary, some light meal preparation, and household tasks, support around medication, pain managing and mental health while helping to reduce the risk of falls. Support to take place in the home the gentleman uses a Zimmer frame to get around the house and a wheelchair for longer distances when out. Also, to be flexible to cover for holidays and sickness leave. The role requires close personal contact with an individual who is extremely vulnerable to the risk of infection and disease transmission. Preference may be given to applicants who have been fully vaccinated against Covid-19. Careful consideration will be given to applicants who can show the vaccination is not suitable for them on reasonable grounds. Personal specification: Calm, patient and understanding Honest, reliable and with a caring nature Punctual, trustworthy and Respect confidentiality Have a happy positive caring nature Have an outgoing personality Ability to both take instructions and use own initiative Experience in health & social care desirable – experience in working with people with both physical and mental health needs Respect confidentiality is a must Further Information: An Enhanced Disclosure and Barring Service Certificate (DBS) will have to be obtained for the successful candidate (at employer’s expense). Training: Where it is required, such as in Health and Safety matters, practical training and guidance will be arranged and the care worker will be expected to attend. This will include moving and handling, medication awareness and additional training specific to the client. Key Responsibilities Services Meal Preparation Personal Care Domestic Care Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Understanding challenging behaviour Food Hygiene First Aid Hand hygiene Medical Safe Administration of Medication Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Blyth, NE24",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/13397161"
    },
    {
      "id": 13397159,
      "title": "Care Assistant for a teenage boy P/T £13.09/hr in Cramlington - FTE - £25.5k",
      "summary": "Care Assistant for a teenage boy P/T £13.09/hr in Cramlington - FTE - £25.5k Apply at UKCIL.com. Reference: fccb98c9 A young man in the Cramlington area is looking to recruit an enabler to support him with accessing activities in his local community. The young man has a diagnosis of Autism, Learning Disability, Attention Deficit Hyperactivity Disorder (ADHD) and Tourette’s (vocal and movement which is slight, however, can deteriorate when in times of stress and anxiety). The family are looking for a carer who understands that it will be necessary to take a person-centred approach to all activities this young man chooses to engage in. This will require a special set of skills as this young man can be very vulnerable and gets very anxious, therefore gaining his trust is a priority. The young man loves art, drawing and creating stories as well as Pokémon. He likes forests, woods and wood carving. He currently attends forestry school. He has spoken of a possible interest in badmington. Hours of work: 6hr a week preferably on a Saturday and an additional 6 hrs a week during school holidays - Days and times to be discussed at interview Rates of Pay: £13.09 per hour 5.6 weeks holiday (pro rata) Mileage paid : To be discussed at interview Location: Cramlington area Main Duties: Acting as a 'support buddy', encouraging his interests which include the above A plan will need to be adhered to and developed by the support buddy. Positive reinforcement is a must as although the young man needs to be out in the community, he will need a great deal of encouragement and patience to encourage this. He will initially need to be seen in the home so he can gain confidence in developing a relationship. Personal specification: Car driver preferred Non-Smoker Calm, patient and understanding Honest, reliable and with a caring nature. Punctual, trustworthy and Respect confidentiality. Have a happy positive caring nature. Have an outgoing personality Ability to both take instructions and use own initiative. Experience in health & social care desirable – awareness in learning disability, autism, and ADHD Flexibility and Respecting confidentiality is a must The role requires close personal contact with an individual who is extremely vulnerable to the risk of infection and disease transmission. Preference may be given to applicants who have been fully vaccinated against Covid-19. Careful consideration will be given to applicants who can show the vaccination is not suitable for them on reasonable grounds. Further Information: An Enhanced Disclosure and Barring Service Certificate (DBS) will have to be obtained for the successful candidate (at employer’s expense). Training: Where it is required, such as in Health and Safety matters, practical training and guidance will be arranged, and the care worker will be expected to attend. This will include moving and handling, medication awareness and additional training specific to the client. Key Responsibilities Services Social  Leisure activities Support to remain independent Training Safeguarding Adults/Children Understanding challenging behaviour First Aid Autism / Aspergers Transportation Full UK driving license Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Cramlington, NE23",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/13397159"
    },
    {
      "id": 14354188,
      "title": "Care Assistant for a young boy P/T £13.09/hr in Hexham - FTE - £25.5k",
      "summary": "Care Assistant for a young boy P/T £13.09/hr in Hexham - FTE - £25.5k Apply at UKCIL.com. Reference: a3021c32 To provide support for a 10-year-old male child with severe learning disabilities and depletion on the 19th Chromosome, which causes learning difficulties and communication problems and affects his development and understanding. He also has poor fine and gross motor control. Main Duties We are looking to recruit a Support Worker to enable this child to access social and leisure activities in the local community. Due to his learning disabilities and living in a rural location, it is very difficult for him to engage with other children his age outside of the school environment. It is hoped that a Support Worker can help him safely enjoy some of his favourite activities which include swimming, soft play, role play, trampolining, clip and climb and travelling on buses. He would really love to join in any social groups taking place nearby as there are currently none where he lives, so that he can make new friendships with other children. Hours: 7 hours per week during term time weeks and 10 hours per week during all school holiday weeks. These hours include travelling time from the child’s home. Flexibility around which days of the week the support takes place and this can be further discussed with interested applicants. Rate of pay: £13.09 per hour. Holiday entitlement is 5.6 weeks per year pro-rata. Any out-of-pocket expenses will be paid by the employer. Person Specification: The successful applicant must: · have experience and a positive understanding about children who have disabilities · have a genuine interest in working with children with complex needs · have a high degree of initiative · be punctual and reliable as the child cannot be left unsupervised · be flexible · have a happy, positive and caring nature · respect confidentiality Car driver essential and must be used insurance for business use. The successful candidate will require an Enhanced Certificate of Disclosure (DBS), cost to be met by employer. Key Responsibilities Services Social  Leisure activities Training Essential PA Guide Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Hexham, NE48",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354188"
    },
    {
      "id": 14354189,
      "title": "Family Friendly PA for Lady in Little Plumstead. 3hrs weekly at £11.68 per hr",
      "summary": "Family Friendly PA for Lady in Little Plumstead. 3hrs weekly at £11.68 per hr Apply at UKCIL.com. Reference: 85428a6e Job description Listed below are details of the purpose and general tasks of the job to provide some insight of what is involved. It is advisable to refer to this when submitting your application for the post. Job Purpose To provide support at home for lady with various health issues Location Little Plumstead, NR13 Details As a family lady with various health issues including chronic fatigue, hypermobility and anxiety, I am looking for a personal assistant who can support me with family life. I would like to have one session weekly doing some batch cooking which will help me to ensure the family have healthy meals, and the P.A. will also help me with managing basic household administrative tasks and making phone calls. My PA needs to be happy to work around pets, we have a friendly dog. Person specification · Family friendly · Well organised and capable of dealing with admin tasks · Basic cooking skills · Flexible Summary terms and conditions · The rate of pay for this position is £11.68 per hour · Hours and times of work: 3 hours weekly, flexible but usually done as 2 sessions of 1.5hrs. · 5.6 weeks per year pro-rata paid leave, inclusive of bank holidays · Free Careskills Training The post is subject to the following: · A satisfactory enhanced Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer. · Completion of a satisfactory probationary period of 3 months Key Responsibilities Services Meal Preparation Domestic Care Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Norwich, NR13",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354189"
    },
    {
      "id": 14354193,
      "title": "Care Assistant for a young boy 4hrs pw  £13.09/hr in Amble -(8 hrs for school hols)",
      "summary": "Care Assistant for a young boy 4hrs pw  £13.09/hr in Amble -(8 hrs for school hols) Apply at UKCIL.com. Reference: bd8507f7 We are looking to recruit a dedicated staff member to support a child in Amble. This child has a diagnosis of Autism, PICA and Epilepsy requires support to access local activities. Hours of work: 4hrs term-time (x 39 weeks) rising to 8hrs in school holidays. Hours to be arranged flexibly but will mostly be needed on evenings and/or weekends. During school holiday weeks times can be arranged flexibly with the employer. Training: Experience preferred but not essential as full training will be provided by the employer . Where it is required, such as in Health and Safety, medication and safeguarding this will take place on-line unless otherwise stated. Main Duties: The role is to enable this child to access age-appropriate activities within the local community. Loves water but has no concept of danger, regardless of depth. Enjoys going to the park and again, cannot be left unsupervised at any time. The child will require support with personal care, but there are no requirements to administer medication. Rates of Pay: £13.09 per hour Location: Amble Personal specification: · Have experience and a positive understanding about children who have disabilities. · Have a genuine interest in working with children with complex needs. · Experience of epilepsy would be an advantage. · Be punctual and reliable as the child cannot be left unsupervised. · Have a positive and caring nature. · Respect confidentiality. · Must hold a full driving license. Further Information: An Enhanced Disclosure and Barring Service Certificate (DBS) will have to be obtained for the successful candidate; cost will be met by Northumberland County Council. Key Responsibilities Services Personal Care Social  Leisure activities Support to remain independent Training Safeguarding Adults/Children Transportation Full UK driving license Own personal car Medical Continence Care Epilepsy Awareness Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "MORPETH, NE65",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354193"
    },
    {
      "id": 14354190,
      "title": "Care Assistant for a lady 7 hrs p/w  £13.09/hr in Morpeth - FTE - £25.5k",
      "summary": "Care Assistant for a lady 7 hrs p/w  £13.09/hr in Morpeth - FTE - £25.5k Apply at UKCIL.com. Reference: 0133c1df Lady in Morpeth requires a personal assistant to support with 7hrs weekly. Hours are flexible throughout the week, but some hours will be needed on evenings. Hours and availability can be discussed at interview. Care driver with own car required – Business use insurance required when taking client out Experience preferred of working with people with mental health conditions. Hours of work: 7hrs per week Rates of Pay: £13.09 per hour Main Duties: The ideal person would be someone with a sense of humour and some life experience. Support required to take client shopping and cooking meals so an interest in cooking varied and healthy options from scratch would be a bonus. Also enabling support required with socialising and accessing the local community and visiting places of interest. Although client does not have a dog they would love to find someone who is a fellow dog lover and maybe their own dog who client would be happy to have in the house and maybe go for short walks with worker and dog. Personal specification: Assertive but reassuring Honest, reliable and caring nature. Punctual and trustworthy Respect confidentiality Further Information: An Enhanced Disclosure and Barring Service Certificate (DBS) will have to be obtained for the successful candidate (at employer’s expense). Training: Where it is required, such as in Health and Safety matters, practical training and guidance will be arranged and the care worker will be expected to attend. Key Responsibilities Services Meal Preparation Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Food Hygiene First Aid Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Morpeth, NE61",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354190"
    },
    {
      "id": 14354191,
      "title": "Care Assistant for a young boy 10 hrs  £13.09/hr in Hexham area - (15hrs school hols)",
      "summary": "Care Assistant for a young boy 10 hrs  £13.09/hr in Hexham area - (15hrs school hols) Apply at UKCIL.com. Reference: 536b1d75 We are looking for a committed support worker to allow a 9-year-old young boy in the Hexham area to access social and leisure activities predominantly in the home and local area. The young boy has autism, severe ADHD, development delay and a sleeping disorder. He has OCD and this includes Aversion/restrictive Food Intake Disorder (ARFID). As a result, he has no awareness of risk and danger and needs support to remain independent and access suitable activities. Main carers will help you to understand his needs and how best to support him and build an appropriate relationship. The young man loves his home environment. His interests include: · playing in the garden or at the local park · Cooking · Playing Roblox · Colouring in The support is to allow him to have time away from his main carer, remain safe and most importantly have fun. He will need supervision when eating and guidance around this will be provided by those who know him best. He is not very keen on loud noises and can be a little upset if you try to take him away from things he is interested in. Somebody who can adapt and divert his attention during these times would be preferred. The ideal applicant will be: · Patient · Kind · Caring · Have a good sense of humour · Be willing to actively engage in the activities with the child and not just supervise Rate of Pay: £13.09 per hour Hours Breakdown: · 10 hours per week during term time · 15 hours per week during school holidays Hours to be used on a Saturday during school time but may not be every Saturday. More flexibility needed in the school holidays Key Responsibilities Services Social  Leisure activities Support to remain independent Training Safeguarding Adults/Children Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Corbridge, NE45",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354191"
    },
    {
      "id": 14354192,
      "title": "Lady in Norwich seeking 2 female PAs on a job share basis for 56 hours a week  £15 p/h",
      "summary": "Lady in Norwich seeking 2 female PAs on a job share basis for 56 hours a week  £15 p/h Apply at UKCIL.com. Reference: 39dbfd30 Job Purpose: I am a friendly lady who, due to mobility issues, is seeking two Personal Assistants to help me maintain my independence and quality of life. The main duties of this role will include assisting with personal care, housework, meal prep, light gardening and helping to take me out and about i.e., for shopping, tea and coffee and lunch etc. I have a love of good food and someone who is able to cook would be ideal. I am a spiritual person and a devout Christian and would like someone who is able to take me to church as and when required. Before my health problems I was a tutor and educator. I love books and reading and greatly enjoy visiting museums, galleries and cultural centres. I enjoy social activities and going to the theatre and cinema and love shopping and visiting cafes. I also greatly enjoy talking to people and someone who likes good conversation would be ideal. Female PAs required due to personal care. Please specify on application which days of the week/hours you are applying for. Location: Norwich, NR1 Details: - 7 hours a day, 7 days a week, to be split between two PAs - Personal care - Housework - Meal Prep - Light gardening - Helping me to get out and about i.e. shopping, tea and coffee, lunch etc - Taking me to church as and when required - Picking up my prescriptions from the pharmacy Person specification: Listed below are the skills, competencies and qualities that are essential and desirable for the post. My assessment of these, both on application and at interview, will be the main factor in determining if you are successful. Please refer to these when submitting your application. Essential: - Friendly, caring, patient - Punctual and reliable - Trustworthy and confidential - Able to work to own initiative - Flexible Desirable: - Full UK driving licence and own car with appropriate level of business insurance - Someone who can cook - Someone who enjoys good conversation - Willing to take up training as required Summary terms and conditions: - The rate of pay for this position is £15 per hour - You will be reimbursed for any agreed expenses incurred as part of the role - Free Care Skills training available to all employed workers - Hours and days of work: 8 hours a day, 7 days a week. - 8.30am to 3pm - 7pm to 8.30pm The post is subject to the following: - If this job requires: manual Handling, handling of hazardous chemicals or food handling, you will be required to undertake annual training - A satisfactory Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer - Satisfactory references from two referees, one of which must be your current or last employer - Completion of a satisfactory probationary period of 3 months Key Responsibilities Services Meal Preparation Personal Care Domestic Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Moving & Handling Food Hygiene First Aid Hand hygiene Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Norwich, NR1",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354192"
    },
    {
      "id": 14354194,
      "title": "Personal assistant for young boy £11.68ph in Walpole St Peter during school holidays",
      "summary": "Personal assistant for young boy £11.68ph in Walpole St Peter during school holidays Apply at UKCIL.com. Reference: 7c1a5030 Job description: Social care work opportunity for a Personal Assistant. Listed below are details of the job and what tasks are involved. It is essential to refer to these when submitting an application and advise of the days/hours you are available. Job purpose: Facilitate within the home at the start of the job, this is to be able to build trust and manage the young boys needs, which can vary depending on circumstances that day but will include changing pads, ensuring he is fed and watered. The long term goal, once trust has been built will be to going out and about to places of interest such as; going out on walks, visit parks, and to soft play, where he can get around safely on his own allowing him to have free roam, which he thoroughly enjoys. The young boy has very limited communication and mobility. When out and about he uses a manual wheelchair, but is starting to take steps whilst under supervision at home. Food has to be cut down, due to a high risk of chocking due to not being able to chew, and currently has to be manually fed. He loves Mr Tumble, flashing lights and music. Location: Walpole St Peter PE14 Details: - Provide support at home - Eventually go out and about to places of interest - Provide food and water safety to prevent chocking - Changing pads - Other duties that may be appropriate on the day - Ensure he is safe at all times - Everyday is different - Provide one to one support away from the other children in the household. Person Specification Listed below are the skills, competencies and qualities that are essential and desirable for the post. Assessment of these, both on application and at the interview, will be the main factor in determining your success. Essential: - Experience with children with additional needs - Experience with Autism - To have knowledge that can be shared with the family to enable them to build their knowledge. - Full UK Driving licence - Use of own car for work purposes. Car will need to be big enough to transport his wheelchair. - Reliable - Approachable - Trustworthy - Friendly - Patient Summary Terms and Conditions The rate of pay for this position is £11.68p/h. Hours and times of work as follows: Work during school holidays, which could involve Saturday working. Minimum 4hrs a week. Hours and days to be discussed at interview stage. A satisfactory enhanced Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer Completion of a satisfactory probation period of 3 months. The annual holiday entitlement for this position will be equivalent to the work I would normally expect to be done during 5.6 consecutive weeks. - If this job requires; • Manual Handling • Handling of hazardous chemicals • Food Handling You will be required undertake annual training. The post is subject to the following: · - A satisfactory enhanced Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer. · - Satisfactory references from two referees, one of which must be your current or last employer. Key Responsibilities Services Meal Preparation Personal Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Moving & Handling Understanding challenging behaviour Food Hygiene First Aid Autism / Aspergers Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Wisbech, PE14",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354194"
    },
    {
      "id": 14183234,
      "title": "Personal Care Assistant for a gentleman F/T £13.21/hr in LS18 - FTE - £25.8k",
      "summary": "Personal Care Assistant for a gentleman F/T £13.21/hr in LS18 - FTE - £25.8k Apply at UKCIL.com. Reference: c186edc5 Hours: part time and full time hours available Job purpose: We are looking for a caring and empathetic person to start in role as a personal assistant (PA) for a 33 year old gentleman with a hypoxic brain injury. Brain injury has resulted in Richard experiencing communication difficulties and requirement for support with all personal care, use of PEG for feeding and medication and use of wheel chair. Richard has grown up in Leeds, worked across many different areas but most recently as a garden landscaper which remains a key passion alongside music, love of comedy, nature and reading. Richard does live within his family home with both parents and younger brother so being comfortable around the family, whilst also respecting our need for family time are great skills to possess. We are looking for a part time role to cover mostly weekends and the occasional cover during the week if available. Flexibility in shifts would be appreciated to support with covering annual leave and sickness. Main duties Personal care duties: • Support with all personal cares such as showering, shaving, brushing teeth, skin care, dressing • Peg feeding Including medication • Catheter care • Seizure monitoring • Performing stretches Social duties: • Support to engage with hobbies such as gardening, listening to music or attending gigs, reading to Richard • Support with attending community activities • Support with attending appointments • Support with seeing friends and family Domestic duties: • support with personal shopping • cooking and serving occasional taster meals • cleaning, changing linen, • laundry These duties may vary from day to day. Key values that we look for in our personal assistants: • reliability and trust • care and compassion • empathy; treat me like you’d want your family to be treated • A willingness to learn Experience: Experience of working in care, epilepsy and/or brain injury is preferred but not essential as full training will be offered, for us it’s more important to recruit someone who’s the right type of person. Previous personal assistance experience preferred but not a requirement as full training will be provided prior to starting the role. Full driving license preferred If you are patient, compassionate, good humoured and are great with people then we would love to hear from you. Key Responsibilities Services Personal Care Domestic Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Moving & Handling First Aid Transportation Full UK driving license Can drive a motability equipped car Medical Safe Administration of Medication Continence Care Catheterisation Epilepsy Awareness PEG Feeding Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Leeds, LS18",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14183234"
    },
    {
      "id": 14183231,
      "title": "Complex Care Assistant/nurse for a lady in WF12 £13hr £156/shift (Days & Nights)",
      "summary": "Complex Care Assistant/nurse for a lady in WF12 £13hr £156/shift (Days & Nights) Apply at UKCIL.com. Reference: fa7bf66c Do you enjoy spending 1:1 time caring for others? Are you kind, caring, compassionate and friendly? Are you a student nurse, doctor, paramedic etc or newly qualified and want chance to experience complex medical care including central lines etc? Do you enjoy new challenges including learning new skills? - If so please keep reading and apply I am a young lady living in Earlsheaton, Dewsbury. I live in an adapted bungalow. I have very complex medical conditions, and require skilled and dedicated complex care assistants to join my team. Despite my challenging conditions it does not stop me from enjoying life to the fullest If you work for me you will assist me in all aspects of my daily life from assistance with washing and dressing, basic domiciliary duties, meal prep and more skilled tasks such as JEJ tubes, injections & syringe drivers and assisting me in IV line care (training provided). But you will also chat to me, partake in activities such as baking, knitting, fused glass making in my home kiln and a myriad of other hobbies I enjoy. Despite needing a significant amount of help, I do like to try have some independence. You will be trained in all aspects of the role & I will guide you while performing tasks. There will be times when I am sleeping as I get a lot of fatigue and you will have some downtime, other times I may want you to sit and watch tv or have a chat to me. You will become part of a wider team of PAs, previous PA's in this position have gained a range of new skills both care/clinical and also by me teaching you my hobbies such as knitting, how to make a glass dish or jewellery or some of my yummy baking treats which you always get to sample. This is a great position if you're looking for a highly varied role, wanting to provide that 1:1 support and make a difference to my life. Pay & Shifts: Pay is £13 hr ( increases to £13.50 once trained, plus annual increases) Shifts done via rota - all breaks are paid breaks. A rota is produced 1 month in advance, holiday must be requested with one month's notice. Main shift times are; Day Shifts 10am-10pm Night Shift 10pm-10am You will be required to work 2 shifts per week (24hrs), with the ability to pick up extra shifts especially covering holiday. You Must be able to work Day & Nights. Depending on the rota you may work 1 day and 1 night per week, or it maybe that you work nights for 1 week and days for the following week. Ability to pick up other shifts or occasionally trade days with notice Annual Leave - Statutory Entitlement Pension - NEST Pension scheme (can opt out) Start Date - ASAP Interested in applying or want to know more about the role - Please get in touch The person im looking for: I am looking for a motivated and organised individual who is outgoing and friendly. I need someone with an excellent grasp of English and can communicate well. I appreciate good conversation and having fun, so I would be looking for someone who has a good sense of humour, who is an excellent communicator as well as an active listener. Ideally you are able to drive, flexible, reliable, respectful and friendly and have similar interests plus an open mind. The Ideal Candidate will have: 6 months care experience (minimum) Experience of more complex tasks (JEJ,PEG,Injections) Female - [Due to working 1:1 doing personal care] Important: Training for this job is mandatory you must be available for training days (TBC) Key Responsibilities Services Meal Preparation Personal Care Domestic Care Social  Leisure activities Support to remain independent Training Moving & Handling Food Hygiene First Aid Hand hygiene Autism / Aspergers Transportation Full UK driving license Own personal car Can drive a motability equipped car Medical Safe Administration of Medication Continence Care Catheterisation PEG Feeding Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Dewsbury, WF12",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14183231"
    },
    {
      "id": 14183233,
      "title": "Care Assistant for a young person P/T £13.09/hr in Cramlington - FTE - £25.5k",
      "summary": "Care Assistant for a young person P/T £13.09/hr in Cramlington - FTE - £25.5k Apply at UKCIL.com. Reference: 069ad324 We are looking for a committed care worker to provide enabling support to an 11-year-old girl in the Cramlington area. The young girl lives at home with her family and the support is to promote her independence and also allow her family time with siblings. The client has a diagnosis of autism with anxiety and mental health concerns. She is fascinated with animals, especially cats, and would prefer somebody who shares this interest and can engage with the her in activities around such interests. She is an imaginative individual but can come across as shy with people she is not familiar with. It is essential you can build an appropriate relationship with the client and support her in the most appropriate way. The ideal candidate will be relatable to a young girl, with a fun personality and the ability to adapt to ever-changing emotions as the client can struggle to manage these independently. Negotiation is an essential skill for the successful applicant, as with any young person of this age, they prefer to be in control and somebody who can negotiate, and compromise would fit best. A driver with access to their own vehicle is an essential criterion for the role. Interviews will initially be via a telephone appointment with a face-to-face interview to follow for the most suitable applicants. Rate of Pay: £13.09 per hour Hours Breakdown: · 5 hours per week to be used in a block on a Sunday · Holiday – 5.6 weeks pro rata per year · Expenses to be paid in agreement with the employer An enhanced Disclosure and Barring Certificate must be provided before commencement of employment. The full cost will be met by the employer Training – where appropriate all training will be provided via Northumberland County Council Learning Together platform. Access will be available to all suitable free courses in agreement with the employer. Key Responsibilities Services Social  Leisure activities Support to remain independent Training Safeguarding Adults/Children Understanding challenging behaviour Autism / Aspergers Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Cramlington, NE23",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14183233"
    },
    {
      "id": 14183232,
      "title": "Personal Care Assistant for a young woman P/T £13.09/hr in Hexham - FTE - £25.5k",
      "summary": "Personal Care Assistant for a young woman P/T £13.09/hr in Hexham - FTE - £25.5k Apply at UKCIL.com. Reference: 9ed7502c We are looking for a committed support worker to enabling a young woman to remain independent and access age-appropriate activities in the community. She lives in the Allendale area and a car driver is essential. A mobility car is available for use to access appropriate activities with the young woman. The support is to promote her independence and allow her family carers a break from this role. The young woman has a neurological disorder called RETTS syndrome. She is non-verbal and uses a range of alternative methods to communicate. The young woman has hypermobility, she is mobile but requires the use of a wheelchair for longer activities. She needs support with all aspects of her daily routine including personal care. The ideal applicant will be: · Female due to the personal care involved in the role · Have experience supporting nonverbal individuals – formal or informal · Physically able to manage mobility and the demands of using a wheelchair · Be confident to build relationship and read emotions from facial expressions · A car driver able to access the client location · Be over 21 years old due to insurance age restrictions on the mobility car available Rate of Pay: £13.09 per hour Hours Breakdown: 10 hours per week. Preferably to be 5 hours on a Monday and 5 hours on a Friday (this could be a Thursday or a Sunday ad hoc to meet availability) Overnights are also available to support the client in her own home whilst family are having an extended break. This will be discussed at interview but is no more than once per month. An enhanced disclosure and barring certificate will be required and the cost of such will be met with the employer. Where applicable full training in all aspects of care will be provided including safeguarding, medication and moving and handling as some of the main areas. Key Responsibilities Services Personal Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Hexham, NE47",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14183232"
    },
    {
      "id": 14354174,
      "title": "Personal Care Assistant for a young person F/T £13.09/hr in Cramlington - FTE - £25.5k",
      "summary": "Personal Care Assistant for a young person F/T £13.09/hr in Cramlington - FTE - £25.5k Apply at UKCIL.com. Reference: e04b9863 We are currently looking to recruit a team of personal assistants/enablers to provide support for three boys all aged 6 years old. We can offer both part and full-time posts. The support is required to enable these boys to access the community with meaningful activities and to assist at home with daily routines. These young boys enjoy woodland walks, visiting the beach and Air Box bounce, farms, and zoos, and have lots of boundless energy. MAIN DUTIES · Support to access activities in the community which the boys enjoy attending and to engage in meaningful and enjoyable time both at home and with outside adventures. · To provide personal care both at home and in the community, and to assist with washing, dressing and mealtimes and to include both morning and evening routines. Rate of pay £13.09 per hour. Holidays are 5.6 weeks per year, pro-rata Person Specification Successful applicant must: · Preferably have experience working with children who have disabilities and who can present with challenging behaviour. · Have a genuine interest in working with children with complex needs and developmental delay. · An understanding of non-verbal children and how to read body language and behaviours. Having some knowledge of Makaton would be useful. · Have an understanding of sensory needs and the difficulties faced by these on a daily basis. · Be able to keep up with these children and be physically fit as this post will require you to act on occasions very quickly. One child has no sense of danger and regardless of where he is taken indoor or outdoor setting he will require constant supervision as he will run away. · Have a high degree of initiative. · Be punctual and reliable and these children cannot be left unsupervised at any time. · Be flexible to cover holidays and sickness. · Respect confidentiality. Training will provided both face to face and online. Further specific training can be discussed at interview. Car driver essential and must have business insurance. An Enhanced DBS Check is required, and the cost will be net by Northumberland County Council. Key Responsibilities Services Meal Preparation Personal Care Social  Leisure activities Training Essential PA Guide Safeguarding Adults/Children Moving & Handling Understanding challenging behaviour Food Hygiene Autism / Aspergers Transportation Full UK driving license Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Cramlington, NE23",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354174"
    },
    {
      "id": 14354175,
      "title": "Care Assistant for a teenage girl P/T £13.09/hr in Belford - FTE - £25.5k",
      "summary": "Care Assistant for a teenage girl P/T £13.09/hr in Belford - FTE - £25.5k Apply at UKCIL.com. Reference: 490d33b4 To provide support for a 17-year-old girl who has a diagnosis of Autism, ADHD and severe Learning Disabilities. Person Specification: We are looking to recruit a support worker to enable this 17-year-old young girl to develop her independence skills and ability to access the community safely. The role will include helping her to understand managing money, using public transport and keeping herself safe when out and about. The ideal candidate will be enthusiastic and have a genuine interest in working with children and young people with complex needs. Essential Requirements: · Always provide close supervision maintaining the young person’s safety in all settings. · Have a high degree of initiative. · Be punctual and dependable as the young person cannot be left unsupervised. · Be flexible. · Have a happy, positive and caring nature. · Respect confidentiality. Hours: 10 hours per week during all school holiday weeks, some flexibility around which days the support takes place. Rate of Pay £13.09 per hour. 5.6 weeks holiday pro-rata. Out of pocket expenses will be met by the employer. Additional Information: An Enhanced DBS disclosure is required, cost to be met by employer. Driving licence required and vehicle must be insured for business use. Key Responsibilities Services Social  Leisure activities Training Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Belford, NE70",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354175"
    },
    {
      "id": 14354179,
      "title": "43 Year Old Male Based In Guiseley - Mon & Tues (Or Thurs) 10 Hrs Per Week",
      "summary": "43 Year Old Male Based In Guiseley - Mon & Tues (Or Thurs) 10 Hrs Per Week Apply at UKCIL.com. Reference: 6b605c31 JOB TITLE: Personal Assistant HOURS: 10 hours per week, split between Monday and Tuesday or Thursday (Occasional extra hours, notice given) RATE OF PAY: p/h plus holidays & benefits when fully trained LOCATION: Guiseley LS20 PURPOSE OF ROLE: 44 year old male with Neurological Conditions, related physical and pain conditions. Need a PA for following hours: Monday 10 - 4 (some flexibility on actual times) Tuesday or Thursday 10 - 2 (some flexibility on times) 10 hours per week I am open to discussions on hours as my other PA has some flexibility with their hours, there may be further hours available on the future I need help with personal care, shopping, taking me out, exercise, medical care etc Tuesday or Thursday hours would mainly be on domestic front after getting me ready for appointment Own car needed although WAV maybe available in the future if required I need a PA in position as soon as possible SUPERVISION: My PA will be directed by and accountable to me, in all aspects of their role. S/he must always respect my independence, and ask rather than assume, what assistance I require. A full induction and training will be given. Successful applicants will be subject to an enhanced DBS check and must hold a clean and valid UK driving license. I will need to have sight of your driving licence and proof of business cover on your vehicle. Due to the nature of the role, strict confidentiality is required. I will reimburse you for mileage when you are working with me. You will need to keep a mileage log in order I can reimburse you. Key Responsibilities Services Meal Preparation Personal Care Domestic Care Social  Leisure activities Support to remain independent Transportation Own personal car Can drive a motability equipped car Medical Safe Administration of Medication Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Leeds, LS20",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354179"
    },
    {
      "id": 14354183,
      "title": "Part time Personal Assistant required in the Wymondham area.",
      "summary": "Part time Personal Assistant required in the Wymondham area. Apply at UKCIL.com. Reference: d2382adc We are looking for an energetic person to join our small care team caring for a lively 35 yr old male living in his own home. 1-2 night shifts and 1-2 afternoon shifts available. Must be willing to work alternate weekends. Experience of Autism, Epilepsy, Learning Disabilities with associated challenging behaviours is essential. Pay rate from £11.50/hr. Key Responsibilities Services Meal Preparation Personal Care Domestic Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Understanding challenging behaviour Food Hygiene First Aid Autism / Aspergers Transportation Full UK driving license Medical Safe Administration of Medication Epilepsy Awareness Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "WYMONDHAM, NR18",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354183"
    },
    {
      "id": 14354176,
      "title": "Personal Care Assistant for a teenage boy P/T £13.09/hr in Corbridge - FTE - £25.5k",
      "summary": "Personal Care Assistant for a teenage boy P/T £13.09/hr in Corbridge - FTE - £25.5k Apply at UKCIL.com. Reference: febdb361 THIS POSITION IS BASED IN CORBRIDGE Corbridge, Northumberland To provide support for a 16-year-old young male with Down Syndrome. We are looking to recruit a Support Worker to enable this young person to access social and leisure activities within the local community. He is a happy and outgoing young person who enjoys being outdoors; as well as going to soft play and various other activities. He uses a wheelchair and requires support to enable him to get out and about. He also has a learning disability and cannot communicate verbally, making his needs known using symbols and photographs, however he can understand simple verbal instructions. The young person requires support with all aspects of his self-care, including meals, getting dressed and his personal care. Hours 5 hours per week  20 hours over a 4-weekly period. Rate of pay - £13.09 per hour. Holiday entitlement is 5.6 weeks per year pro-rata. Any out-of-pocket expenses will be met by the employer. Person Specification The successful applicant must: · Have experience and a positive understanding about young people who have disabilities. · Have a genuine interest in working with young people with complex needs. · Have a high degree of initiative. · Be punctual and reliable as the young person cannot be left unsupervised. · Be flexible. · Have a happy, positive and caring nature. · Respect confidentiality. Full, clean driving licence required and must be insured for business use. The successful candidate will require an Enhanced Certificate of Disclosure (DBS), cost to be met by employer. Key Responsibilities Services Meal Preparation Personal Care Social  Leisure activities Training Safeguarding Adults/Children Moving & Handling Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Corbridge, NE45",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354176"
    },
    {
      "id": 14354178,
      "title": "Home Help - £13.49ph",
      "summary": "Home Help - £13.49ph Apply at UKCIL.com. Reference: d963cea0 I am looking for domestic help in our home - cleaning, ironing, changing beds - physical jobs that I struggle with. No personal care is required. We are a family of 4, including 2 autistic teenagers. Help entertaining them a bonus. Husband works shifts. Needs to be flexible as to when helps, due to husband sleeping some daytime hours each week. Hours dependant on what you're able to offer. Can increase hours if we both feel job suitable/want to take on more of a roll. We're semi rural, so a car is beneficial Look forward to hearing from you. Thank you Key Responsibilities Services Meal Preparation Domestic Care Social  Leisure activities Support to remain independent Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Pudsey, LS28",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354178"
    },
    {
      "id": 14354185,
      "title": "Care Assistant for a teenage boy P/T £13.09/hr in Corbridge - FTE - £25.5k",
      "summary": "Care Assistant for a teenage boy P/T £13.09/hr in Corbridge - FTE - £25.5k Apply at UKCIL.com. Reference: 7158f2a1 THIS ROLE IS BASED IN CORBRIDGE To provide support for a 12-year-old male child with a diagnosis of Autism and ADHD. Main Duties We are looking to recruit a Support Worker to enable this child to access social and leisure activities within the local community; he enjoys being outdoors playing football, tennis and horse riding. The young person’s autism means he can be anxious in new and busy situations. He can at times act impulsively therefore, close support and encouragement will be needed. Hours 5 hours per week  20 hours over a 4-weekly period. Rate of pay £13.09 per hour. Holiday entitlement is 5.6 weeks per year pro-rata. Any out-of-pocket expenses will be met by the employer. Person Specification The successful applicant must: · Have experience and a positive understanding about children who have disabilities. · Have a genuine interest in working with children with complex needs. · Have a high degree of initiative. · Be punctual and reliable as the child cannot be left unsupervised. · Be flexible. · Have a happy, positive and caring nature. · Respect confidentiality. Full, clean driving licence required and must be insured for business use. The successful candidate will require an Enhanced Certificate of Disclosure (DBS), cost to be met by employer. Key Responsibilities Services Social  Leisure activities Training Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Corbridge, NE45",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354185"
    },
    {
      "id": 14354177,
      "title": "Care Assistant for a young girl P/T £13.09/hr in Cramlington - FTE - £25.5k",
      "summary": "Care Assistant for a young girl P/T £13.09/hr in Cramlington - FTE - £25.5k Apply at UKCIL.com. Reference: 878e060a We are looking to recruit a second enthusiastic and committed Care Worker to provide 2:1 close supervision for a 10-year-old girl with a diagnosis of Pontocerebellar Hypoplasia which results in the degeneration of the brainstem and cerebellum and affects neurological development. Main Duties The support will be delivered both at home and in the community accessing age-appropriate activities including going to the beach, where she loves to build sandcastles, and visiting the woods. The child has no danger awareness so very close supervision and support will be required to ensure her safety, especially when near water. We are looking for an enthusiastic and committed care worker and somebody who enjoys being outdoors but is equally happy to engage in indoor activities including baking and art on poor weather days. The child can sometimes present with some unpredictable behaviours and has some complex sensory issues, and we require an enabler who can support her in managing this whilst continuing to access appropriate activities. She is non-verbal and has limited methods of communication, so experience in working with children presenting with similar needs would be an advantage. There is no medication administration required for this role. Hours 5 hours per week during term time weeks with an additional 10 hours per week during all school holiday weeks (i.e. 15 hours per week in school holidays). Some flexibility on the days/times required which can be discussed with successful the applicant. There is one support worker already in post and you will therefore be working alongside them to deliver the 2:1 support this little girl needs. Person Specification The successful applicant must: · have experience and a positive understanding about children who have disabilities · have experience of communicating with children who are unable to fully communicate verbally · have a genuine interest in working with children with complex needs · be able to respond sensitively and positively to any changes in behaviour · have a high degree of initiative · be punctual and reliable as the young person cannot be left unsupervised · be flexible · have a happy, positive and caring nature · respect confidentiality Rate of pay £13.09 per hour. 5.6 weeks holiday pro rata. Out of pocket expenses will be met by the Employer. This post is subject to a satisfactory Enhanced DBS check, cost to be met by Employer. Car driver essential and must be insured for business use. Any further information: Key Responsibilities Services Social  Leisure activities Training Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "CRAMLINGTON, NE23",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354177"
    },
    {
      "id": 14354181,
      "title": "PA needed for female in IP22 area, 5 hrs a week £11.68 p/h",
      "summary": "PA needed for female in IP22 area, 5 hrs a week £11.68 p/h Apply at UKCIL.com. Reference: ec501415 Job Purpose To take me to appointments and social activities. Location: IP22, Roydon Main Duties: Take me out to Social Activities Housework, including General Cleaning Help with the weekly shop, and Hospital Appointments These duties may vary from day to day. Any other reasonable duties that may be necessary Person Specification Listed below are the skills, competencies and qualities that are essential and desirable for the post. My assessment of these, both on application and at the interview, will be the main factor in determining your success. Please refer to these when submitting your application. Essential Female Friendly Good Sense with Humour Car with Business Insurance Summary Terms and Conditions You will be reimbursed for any agreed expenses as part of this role. The rate of pay for this position is £11.68 p/h. Hours and times of work will be 5 hours each week, to be done over 2 days a week for 2.5 hours. Exact times to be negotiated with employer. A satisfactory enhanced Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer Satisfactory passing of mandatory training care courses. Satisfactory references from two referees, one of which must be your current or last employer. Completion of a satisfactory probation period of 3 months. Key Responsibilities Services Domestic Care Social  Leisure activities Support to remain independent Training Essential PA Guide Safeguarding Adults/Children Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Diss, IP22",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354181"
    },
    {
      "id": 14354180,
      "title": "Three Care Assistants for a three siblings P/T £13.09/hr in Prudhoe - FTE - £25.5k",
      "summary": "Three Care Assistants for a three siblings P/T £13.09/hr in Prudhoe - FTE - £25.5k Apply at UKCIL.com. Reference: b75419c6 We are looking to recruit 3 experienced support workers for three siblings so that they can each enjoy social and leisure activities in the local community with their own support worker. The 9 year old child has a multi-sensory impairment, a severe learning disability, social, emotional, speech and language communication difficulties. His favourite activities include bowling and trampolining. He does not like the cold, wind or being wet. The 10 year old child has Autism, a severe learning disability and can struggle with regulating his emotional behaviour at times. He particularly enjoys being goalkeeper when playing football and similar to his siblings likes bowling and trampolining. The 13 year old child has Autism, a severe learning disability and speech and language communication difficulties. His favourite activities are also bowling, trampolining, football and basketball. Rate of Pay: £13.09 per hour Hours Breakdown: 3 x hours a week for each child during term time (39 weeks per year) 6 x hours a week for each child during school holidays (13 weeks per year) Times to be agreed with successful applicants and family Key Responsibilities Services Social  Leisure activities Training Essential PA Guide Safeguarding Adults/Children Understanding challenging behaviour Autism / Aspergers Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Prudhoe, NE42",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354180"
    },
    {
      "id": 14354187,
      "title": "Female PAs to assist a young lady with Independent living tasks in LS26 (leeds)",
      "summary": "Female PAs to assist a young lady with Independent living tasks in LS26 (leeds) Apply at UKCIL.com. Reference: 12041248 We are seeking individuals to provide care and support as Personal Assistants. The ideal candidate will possess the following qualities: honesty, open-mindedness, creativity, flexibility, motivation, and resourcefulness. The candidate should also have a good sense of humour, and be kind, affectionate, and considerate in their approach. The current hours we are looking for: Weekdays: Monday, Tuesday, Wednesday & Friday 8am-5pm to support L to attend Arts & Crafts initially, which we would look to increase hours to support at home in the future for suitable applicants Weekends: 12-6pm (flexible hours) Pay rates Weekdays: £12.40 (gross) per hour at all times Weekend: £15.44 per (gross) hour at all times Key Responsibilities Services Personal Care Social  Leisure activities Training Essential PA Guide Safeguarding Adults/Children Moving & Handling Food Hygiene First Aid Hand hygiene Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Leeds, LS26",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354187"
    },
    {
      "id": 14354182,
      "title": "Female Care Assistant for a lady in DH7 area of Durham £12.00 per hour",
      "summary": "Female Care Assistant for a lady in DH7 area of Durham £12.00 per hour Apply at UKCIL.com. Reference: 26c353a3 Female Personal Care Assistant required to provide support to a lady with limited mobility to support with personal care needs & dressing, to prepare food & general housework alongside client’s needs. 16hrs 30mins per week Approx. 12 00pm – 13 30pm - 5 days per week Monday To Friday 6pm – 7pm Monday – Friday Wage rate £12 00 per hour Times may be flexible to suit client’s needs & client may require extra support on mornings in the future Experience not essential but preferred DBS & references required Training will be given if required ie food hygiene /first aid etc Non smoking environment Key Responsibilities Services Meal Preparation Personal Care Domestic Care Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "Durham, DH7",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354182"
    },
    {
      "id": 14354184,
      "title": "Personal Care Assistant for a young girl P/T £16.41/hr in the Throckley area.",
      "summary": "Personal Care Assistant for a young girl P/T £16.41/hr in the Throckley area. Apply at UKCIL.com. Reference: da4464bb We are currently looking to recruit an experienced Personal Assistant, to provide support for a child who is 7 years of age with complex health care needs. This little girl has spina bifida and sometimes requires breathing support via a ventilator; her ventilation needs have improved but she may have occasions where she needs support if she is unwell. The successful candidate would work alongside her family and other personal assistants to care for her at home, where it will be an important requirement to form a relationship with the child and her family, so that you can learn how to meet her complex health needs and help her to continue to develop. She is bright and engaging and can communicate verbally and as part of your role you will be supporting her to access fun activities both at home and in the local community. She loves to play and do fun activities, including visits to the park and baking at home. Hours: There is a little flexibility around the 3:30pm start time on Tuesday i.e. a slightly later start will be considered. Tuesday from 3:30pm to 8:30pm Sunday 9:00am to 3:00pm Role Responsibilities: · You should have the confidence to care for a child with complex needs in a community setting and be able to work in partnership with her parents. · To play, engage and care for this little girl as appropriate to age. · Experience of caring for a child with complex needs would be an advantage, however training will also be provided. · To work under the guidance of her parents and advise them of any concerns. · To recognise your own limitations and say if not yet confident to carry out any tasks. · To prepare/clean equipment/feed/medication as directed by her parents and/or plan. Typical work activities vary according to the role, but may include: · Playing and engaging as appropriate. · Administering medication as per plan. · Gastrostomy feeds as per plan. · Personal care tasks. · Ensure that the area where you are working is always kept clean and tidy, to ensure the safety and wellbeing of the child. You will be required to pass background checks by the Enhanced Disclosure and Barring Service (DBS), cost to be met by the employer. Car driver essential and must be insured for business use. Rate of Pay: £14.80 per hour. Holidays are 5.6 weeks per annum, pro-rata. Out of pocket expenses will be met by the employer. Key Responsibilities Services Personal Care Social  Leisure activities Training Essential PA Guide Safeguarding Adults/Children Transportation Full UK driving license Own personal car Medical Safe Administration of Medication PEG Feeding Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "NEWCASTLE UPON TYNE, NE15",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354184"
    },
    {
      "id": 14354186,
      "title": "Personal Care Assistant Required in Toftwood, up to 15 hrs p/w  £13 p/h",
      "summary": "Personal Care Assistant Required in Toftwood, up to 15 hrs p/w  £13 p/h Apply at UKCIL.com. Reference: c6cd32f5 Job description: Listed below are details of the purpose and general tasks of the job to provide some insight of what is involved. It is advisable to refer to this when submitting your application for the post. Job Purpose: I’m a very friendly lady, who loves my garden and my cat. As I have mobility difficulties, I would like your support with domestic tasks, limited personal care, shopping and other local trips. Location: Toftwood, Dereham. Details: Domestic tasks including cleaning, laundry, changing bed linen and ironing. Meal preparation. Aspects of personal care such as helping me to put on socks and shoes, creaming my legs and assisting me to wash my hair. Shopping and other local trips out. Taking the time to build a rapport with me as I find it difficult to trust new people. Person specification: Listed below are the skills, competencies and qualities that are essential and desirable for the post. My assessment of these, both on application and at interview, will be the main factor in determining if you are successful. Please refer to these when submitting your application. Essential: Car owner/driver with suitable business use insurance. Female due to the personal care aspects of the role. Trustworthy and able to build a rapport. Happy to work around a cat. Summary terms and conditions: The rate of pay for this position is £13 per hour You will be reimbursed for any agreed expenses incurred as part of the role. Hours and times of work: 15 hours per week to be worked 09:30am-1:30pm on a Monday, Tuesday and Friday, and 09:30am-12:30pm on a Thursday, with some flexibility available. If this job requires any of the following: manual handling, handling of hazardous chemical, food handling or the handling of medication, you will be required undertake annual training. The post is subject to the following: A satisfactory enhanced Disclosure & Barring Service (DBS) check, the cost of which will be covered by the employer. Satisfactory references from two referees, one of which must be your current or last employer. Completion of a satisfactory probationary period of 3 months. Key Responsibilities Services Meal Preparation Personal Care Domestic Care Social  Leisure activities Transportation Full UK driving license Own personal car Please apply by clicking above or at ukcil.com",
      "company": "UKCIL",
      "activedate": {
        "start": "2024-04-17T06:53:00Z",
        "end": "2024-05-17T06:53:00Z"
      },
      "location": {
        "location": "DEREHAM, NR19",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354186"
    },
    {
      "id": 14354170,
      "title": "Nightshift Replenishment Supervisor",
      "summary": "This is a full time working 38 hours per week across 4 shifts. We have an exciting opportunity for a Nightshift Replenishment Supervisor to manage one of our busy branches. A challenging role that will need leadership and drive as you coach your team to deliver great on shelf availability for our valued customers. Keeping your team focused on delivering great results and working in a safe manner will be key. The role may involve some duty management where full training will be given. Real opportunities for progression across the Booker Group with many of our Supervisors moving into Store Management roles. We operate a 5/7 day operation and opening times can vary from Branch to Branch. Please visit www.booker.co.uk and select Branch Locator to find the current opening times. Real opportunities for progression across the Booker Group with many of our Supervisors moving into Store Management roles. We operate a 5/7 day operation and opening times can vary from Branch to Branch. Please visit www.booker.co.uk and select Branch Locator to find the current opening times. Ensuring that the team comply with legal standards and company procedures at all times. Reducing stock loss by challenging causes of shrinkage and wastage Reducing replenishment costs, by ensuring stock is handled efficiently at all times, products have appropriate space for rate of sale and accuracy and security in the goods receiving department Working with the stock control and delivery teams to resolve causes of off-sales Effective replenishment to ensure that the branch maintains availability for our customers To be successful in this role your skills and experience will include: Passionate about providing exceptional operations standards for our customers Flexible, adaptable and enjoys working with, as well as, managing a team An excellent communicator and have some experience in supervising or managing a team. Practical experience in the food retail trade.",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Avonmouth Ind. Est. Avonmouth Way BRISTOL, BS11 9YB",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354170"
    },
    {
      "id": 14284637,
      "title": "Part Time Branch Assistant-16 hours",
      "summary": "This is a Part Time position working 16 hours per week with shifts across Friday, Saturday and Sunday. We are looking for someone with a real can-do attitude who is passionate about delivering excellent customer service and willing to go the extra mile for our customers. Working as part of a team you will be working in a dynamic, fast paced environment where no two days are the same. We are 5/7 day operation, (check our website for specific opening times.) We only recruit individuals who are aged 17 and over Customers are at the heart of everything we do, our customers need to be back in their own business as quickly as possible having found what they need, we keep the shelves full, provide speed of service through the tills and wish them a fond farewell or maybe our customers need a delivery and we are accurately picking what they need. Ideally experience within the Wholesale or Retail environment A can do attitude A passion for customer service Be willing to go the extra mile Always be there, on time and properly presented.",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Westland Way Preston Farm Industrial Estate STOCKTON ON TEES, TS18 3TG",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14284637"
    },
    {
      "id": 14354171,
      "title": "Replenishment Supervisor-Twilight",
      "summary": "This is a full time role working 38 hours per week across 5 shifts that will run 1.30pm-10pm. As part of the role training will be given for on first aid and counter balanace forklift driving. Are you looking for a role that offers real ful \\\"fill\\\"-ment ? Do you thrive on team work and like to see the fruits of your labour? We have an exciting opportunity for a Replenishment Supervisor. As part of the store management team you will be tenacious and driven to lead your team to deliver great results. Communicating to them your expectations and goals will be key in achieving an efficient team that ensures we have the products available for our valued customers when they need them. This is an excellent opportunity to be part of something special and to get your career moving. Ensuring that the team comply with legal standards and company procedures at all times. Reducing stock loss by challenging causes of shrinkage and wastage Reducing replenishment costs, by ensuring stock is handled efficiently at all times, products have appropriate space for rate of sale and accuracy and security in the goods receiving department Working with the stock control and delivery teams to resolve causes of off-sales Effective replenishment to ensure that the branch maintains availability for our customers To be successful in this role you will be passionate about providing exceptional operational standards for our customers. You will be flexible in your management style, be able to adapt and rise to the challenges faced and you will enjoy working with and managing a team. Excellent communication skills are essential and you will have some experience in supervising or managing a team. Experience in food retailing is desired but not essential.",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Pottington Business Park BARNSTAPLE, EX31 1HN",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354171"
    },
    {
      "id": 14214250,
      "title": "Part Time Branch Assistant-16 hours",
      "summary": "This is a Part Time position working 16 hours per week with shifts Saturday, Sunday and Monday. We are looking for someone with a real can-do attitude who is passionate about delivering excellent customer service and willing to go the extra mile for our customers. Working as part of a team you will be working in a dynamic, fast paced environment where no two days are the same. We are 5/7 day operation, (check our website for specific opening times.) We only recruit individuals who are aged 17 and over Customers are at the heart of everything we do, our customers need to be back in their own business as quickly as possible having found what they need, we keep the shelves full, provide speed of service through the tills and wish them a fond farewell or maybe our customers need a delivery and we are accurately picking what they need. Ideally experience within the Wholesale or Retail environment A can do attitude A passion for customer service Be willing to go the extra mile Always be there, on time and properly presented.",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Pennine Avenue Portrack Lane, North Tees Industrial Estate STOCKTON ON TEES, TS18 2RJ",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14214250"
    },
    {
      "id": 14354173,
      "title": "Part Time Branch Assistant",
      "summary": "This is a Part Time Position Working 30 Hours Monday to Friday 06:00 -12:00 (1 in 4 Sunday working) We are looking for someone with a real can-do attitude who is passionate about delivering excellent customer service and willing to go the extra mile for our customers. Working as part of a team you will be working in a dynamic, fast paced environment where no two days are the same. We are 5/7 day operation, (check our website for specific opening times.) We only recruit individuals who are aged 17 and over Customers are at the heart of everything we do, our customers need to be back in their own business as quickly as possible having found what they need, we keep the shelves full, provide speed of service through the tills and wish them a fond farewell or maybe our customers need a delivery and we are accurately picking what they need. Ideally experience within the Wholesale or Retail environment A can do attitude A passion for customer service Be willing to go the extra mile Always be there, on time and properly presented.",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Auriol Drive Greenford Park Greenford, UB6 0AZ",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354173"
    },
    {
      "id": 14354172,
      "title": "Deputy Canteen Supervisor - 29 hours",
      "summary": "We are currently seeking a highly skilled and motivated Deputy Canteen Supervisor to join our friendly team in Wellingborough. As a Deputy Canteen Supervisor, you will be responsible for helping to oversee the daily operations of our staff canteen, ensuring the highest quality of food production, and maintaining a safe and efficient work environment. Work closely with the Canteen Supervisor in areas such as: Manage and supervise kitchen staff Oversee and assist with food preparation and ensure that all dishes are prepared according to recipes and quality standards Monitor inventory levels and order supplies as needed Maintain a clean and organized kitchen area Ensure compliance with food safety regulations and maintain proper hygiene practices Train new canteen staff members on proper cooking techniques and procedures Skills relevant for this job Extensive knowledge of food preparation techniques and culinary trends Excellent organizational skills with the ability to prioritize tasks effectively A qualification Level 2 NVQ in Food Hygiene is essential, as well as a knowledge of food safety regulations and best practices Ability to work in a fast-paced environment while maintaining attention to detail Strong communication skills, both verbal and written Experience relevant for this job: Experience of working in busy staff canteen Experience of working with food hygiene Excellent attention to detail Competent in MS Office Experience of delivering great customer service",
      "company": "Booker Group",
      "activedate": {
        "start": "2024-04-17T06:52:00Z",
        "end": "2024-05-17T06:52:00Z"
      },
      "location": {
        "location": "Equity House Irthlingborough Road Wellingborough, NN8 1LT",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354172"
    },
    {
      "id": 14354163,
      "title": "Council Tax & Benefits Assistant - ANG05092",
      "summary": "Job Description Based at Bruce House, Wellgate, Arbroath. This job is workstyle 5. You will have the opportunity to benefit from our flexible and agile working practices. This means you will work from home for part of your week and spend some time in council buildings to best suit your work, meetings and collaboration. You will deal with council tax, council tax reduction, housing benefit, discretionary housing payments, Scottish Welfare fund, educational benefits and financial assessment enquiries. You will also be required to process council tax reduction and housing benefit applications, changes of circumstances and applications for discretionary housing payments, educational benefits, Scottish Welfare fund and financial assessments. Duties will also require you to administer the billing and redemption of council tax. This job is temporary for up to 12 months from date of appointment to cover maternity leave. Internal and external applications on a secondment basis will be considered. You must have the approval of your line manager / organisation. Please note interviews will be held Monday, 20 May 2024. Requirements Please refer to job outline and person specification for further details and requirements for this job. About Angus Council Please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Arbroath, DD11 3TP",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354163"
    },
    {
      "id": 14354166,
      "title": "Social Worker (2) - ANG05089",
      "summary": "Job Description Based at Bruce House, Wellgate, Arbroath. This job is workstyle 4. You will have the opportunity to benefit from our flexible and agile working practices. This means you will work from a variety of locations, working from council buildings, working in service user’s locations and site visits and you can work from home to best suit your work, meetings and collaboration. Working within the Angus Integrated Drug and Alcohol Recovery Service (AIDARS), your main duties will include carrying out holistic robust assessments for people who use alcohol and/or substances, providing care packages and reviewing same. There will be a requirement for substance misuse specific training and interventions and also the need for statutory interventions in line with legislation. There are two positions available. One position is permanent and one position is temporary for up to 12 months from date of appointment. Internal and external applications on a secondment basis for the temporary position will be considered. You must have the approval of your line manager/organisation. You will be asked to indicate on your application form which position/s you are applying for. Please note interviews will be held Friday, 24 May 2024. Requirements You must have the ability to become a member of the PVG Scheme. Please refer to job outline and person specification for further details and requirements for these jobs. About Angus Council In addition, please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Arbroath, DD11 3TP",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354166"
    },
    {
      "id": 14354164,
      "title": "Principal Teacher (Health Improvement) - ANG05086",
      "summary": "Job Description Based at Montrose Academy, Academy Square, Montrose. Are you an enthusiastic and inspiring secondary teacher with the skills, confidence and energy to make a positive impact on the lives of our children and young people? Angus is a great place to live, work and visit. You may be eligible for removal/relocation expenses. Please note interviews will be held Monday, 20 May 2024. Requirements You must have the ability to become a member of the PVG Scheme. Please refer to job outline and person specification further details and requirements for this job. About Angus Council In addition, please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Montrose, DD10 8HU",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354164"
    },
    {
      "id": 14354168,
      "title": "Solicitor - ANG05093",
      "summary": "Job Description Angus Council is inviting applications from talented, adaptable and enthusiastic legal professionals to complement our growing legal services team. An exciting opportunity has arisen which is a key role working with our Contracts and Governance Team, offered on a permanent full-time contract. In addition to joining a talented, supportive and welcoming team within Legal, Governance and Change, the post also offers a competitive salary and all the benefits of working for a public sector organisation, including Flexitime and entry to the Local Government Pension Scheme. Angus Council Legal and Democratic Services is committed to working flexibly and equipment will be provided to support working from home. This post is Workstyle 5 – Hybrid plus. In this workstyle most work activity (80%) can be carried out at home or from another location. Approximately 20% of time could be spent at an office desk. Additional time may be spent, when required, in a council building using bookable spaces for collaborative working, meetings, training and mentoring purposes. We are looking for applicants with a positive attitude, a willingness to learn, the desire and ability to work collectively and become a key team member. The workload will be varied, challenging and interesting. You will be supported in a collegiate environment and encouraged to develop a full range of legal and other skills to advance your career with us. You will ideally have post-qualified experience in commercial law and be able to demonstrate a sound understanding of a wide range of commercial law matters. This will include the provision of advisory work to senior management, ideally with experience of major projects, commercial contracts, procurement, state aid/subsidy control, public law, corporate law and construction law. Applicants will be expected to draw upon professional and commercial acumen to provide tailored legal and business solutions. Although experience is desirable, enthusiasm, flexibility and a desire to work in local government is essential. Applications from newly qualified solicitors will also be considered as well as, but not limited to, solicitors seeking a change in career and/or practice area. You must have the ability to obtain a satisfactory Standard Disclosure Certificate. Please note interviews will be held - to be confirmed. Requirements Please refer to job outline and person specification for further details and requirements for this job. About Angus Council Please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Forfar, DD8 1AX",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354168"
    },
    {
      "id": 14354167,
      "title": "Social Worker - ANG05087",
      "summary": "Job Description Based at Angus House, Orchardbank Business Park, Forfar. This job is workstyle 3. You will have the opportunity to benefit from our flexible and agile working practices. This means you will work from a variety of locations including working from council buildings and you can work from home to best suit your work, meetings and collaboration. We are currently recruiting inspiring social workers to join Angus Health and Social Care Partnership. We are looking for someone who shares in our ambitions and is committed to ensuring that service users receive enhanced standards of care and support. You must have extensive knowledge and experience of social work services and demonstrate you have the skills and knowledge to be able to make decisions which support our policy framework, standards and service objectives. As a Social Worker, you will offer interventions, using a co-ordinated holistic approach that helps care staff develop strategies and build competence and confidence to support residents. You will review and support the needs of service users in care home settings ensuring their needs and rights are met. In addition, you will support the delivery of robust scrutiny of practice relating to adult protection, residents of care homes across the service and local multi-agency arrangements to promote the achievement of positive outcomes for service users. You will also actively demonstrate, promote and uphold social work values and deliver fair and evidence-based decision making. If you want to know more about this fantastic opportunity, please contact Sarah Lee on 07553 881461 for an informal discussion Please note interviews will be held Thursday, 16 May 2024. Requirements You must have the ability to become a member of the PVG Scheme. Please refer to job outline and person specification for further details and requirements for this job. About Angus Council In addition, please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Forfar, DD8 1AX",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354167"
    },
    {
      "id": 14354165,
      "title": "School & Pupil Support Assistant - ANG05091",
      "summary": "Job Description Based at Montrose Academy, Academy Square, Montrose. This job is workstyle 1. In this workstyle most of your time is spent undertaking the direct delivery of front-line services work. Depending on your role there may be a limited requirement to access a specific council location during the course of the working week if you are not delivering your service at a council location. Working 32.5 hours per week, you will work directly with young people to support them with their learning targets, through developing positive and supportive relationships. You will assist with a range of duties to support learning, supervising and assisting young people, according to their needs, throughout the school day. Please note interviews will be held - to be confirmed. Requirements You must have the ability to become a member of the PVG Scheme. Please refer to job outline and person specification for further details and requirements for this job. About Angus Council In addition, please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Montrose, DD10 8HU",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354165"
    },
    {
      "id": 14354169,
      "title": "Gardener 2 - ANG05094",
      "summary": "Job Description Based at Broomfield Depot, Broomfield Road, Montrose. This job is workstyle 1. In this workstyle most of your time is spent undertaking the direct delivery of front-line services work. Depending on your role there may be a limited requirement to access a specific council location during the course of the working week if you are not delivering your service at a council location. Please note interviews will be held Wednesday, 22 May 2024. Requirements Please refer to job outline and person specification for further details and requirements for this job. About Angus Council Please refer to the \"applicant guidance\" document when completing your application form and to the \"welcome to Angus\" document and our website https://www.angus.gov.uk/jobs_and_training/working_for_angus_council for more information about working for Angus Council. The Individual We are happy to discuss flexible working during the recruitment process for this position. This means we are open to a conversation about working patterns and the flexibility that is available for this role whilst managing the workload. We offer a guaranteed job interview to the following people who meet the essential criteria on application for a job: Those with disabilities, recognised caring responsibilities and care experienced young people. This also applies to our own employees with caring responsibilities, young people on apprenticeships and placements who meet the essential criteria for the job.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "Angus Council",
      "activedate": {
        "start": "2024-04-17T06:45:00Z",
        "end": "2024-05-17T06:45:00Z"
      },
      "location": {
        "location": "Montrose, DD10 8SY",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354169"
    },
    {
      "id": 14354161,
      "title": "IT Support Officer x 2 - Digital Services",
      "summary": "What's involved with this role: Temporary IT Support Officer x 2 - Digital Services Reference no: Brent 5247525 Pay Rate: £18.66 per hour PAYE Hours per week: 36 Monday – Friday, normal working hours Role Length: This opening assignment is for 3-4 months City: Wembley, London Basic DBS disclosure is required for this role Support and maintain the existing ICT infrastructure for the shared service, covering all four areas of client, datacentre, voice & data network and application support, but with additional specialisation in one of the areas. Work on a rota basis covering call triage, call resolution & escalation, on-site support across all shared service sites, project related work, and provide cover for colleagues in other teams as and when required. Key Requirements: Monitor incoming queues on the IT service desk system perform initial triage of all calls and assign to correct team Take ownership of and resolve calls in line with service level agreement(s). Identify problems, log problem records and communicate appropriately. Log changes, providing adequate information and ensuring change records are kept up to date. Provide on-site support across all sites supported by Shared Technology Services. Build and/or delivery of end user equipment, collection of equipment for repair or disposal, office moves. Work on complex technical projects implementing changes to Shared Technology Services infrastructure. Be part of virtual teams working on specific assignments. Provide cover for colleagues in other teams as and when required. Provide cover and/or work on projects outside normal working hours (08:00 to 18:00) and on occasion at weekends. Accurately and clearly document fixes to technical issues and update the IT knowledge base, enabling their colleagues to quickly resolve any future occurrences of similar issues using this documentation. Document adequate information on call resolution to enable the further analysis of calls handled by Shared Technology Services but also to ensure the customer receives quality feedback in relation to their call. NB: Please feel free to apply to us direct via jobstclrec.com by quoting the job reference and job title exactly. SEE DETAILS AT THE BOTTOM OF THIS AD. To help speed up the process of uploading your CV to the client we would suggest that you send us your CV in Word format (or equivalent) if possible, rather than as a PDF If you are successful in securing this role, please note that for the entire duration of this contract, regardless of extension you will be working this role at the PAYE rate that has been advertised. For absolute clarity, we only work on a PAYE basis, rather than entertaining umbrella pay terms, we do not offer Ltd/umbrella or outside IR35 rates. If you wish to understand PAYE vs Umbrella more, please let us know and we can send you some additional information for clarity. Please quote the Job Title & Vacancy Reference No. in your application, or we will be unable to match your CV to the role being applied for. Other “Essential Requirements” – Please check to ensure that your CV addresses the following items: Unless the DBS requirement stated above is for a Basic Disclosure, your DBS must be either through us or be accompanied by a subscription to the DBS updating service. Qualifications: Evidence of on-going professional development. Knowledge & Experience: Minimum of 12 months recent experience in a similar role, or context and ideally within a public sector organisation. Experience of working in a technically complex IT environment. Experience of working for a local authority/ public sector organisation would be an advantage. Knowledge of the IT Infrastructure Library (ITIL) framework. Working knowledge of hornbill, m365 environment and experience of imaging and repairing of laptops and setup of ios devices via intune. Broad understanding of Datacentre Support Team skillset, including broad understanding of messaging and collaboration systems Team skillet. Broad understanding of Voice & Data Network Support Team skillset. Skills & Abilities: Good customer service skills and a team player. Working on the service desk you will be required to resolve as many tickets as possible at first touch. Able to diagnose and resolve practical problems. Able to prioritise a workload and focus on necessary tasks. Ability to adapt quickly to new developments in software and hardware. Resourceful – able to fully utilise available tools to affect an efficient resolution to a problem. Able to communicate clearly and effectively with staff at all levels in the organisation both verbally and in writing. Able to manage and work on projects to tight deadlines and budgets. Able to train technical and non-technical personnel. Ability to effectively liaise with 3rd party organisations to resolve technical issues. S 1 Job Ref: Brent 5247525 Anticipated Length of Assignment: Unless otherwise stated (we do carry the occasional permanent vacancy) all of our roles are technically temporary, though opening assignments can be and often are, extended by clients on a longer term basis and can sometimes become permanent. Please do try to resist contacting us with requests for progress updates. We really do read every CV sent to us. All applications will be acknowledged by a human, not a robot, provided the job remains live and provided your CV meets the “Essential Requirements” listed. Please note that we do our level best to take down ads as soon as roles have been filled. We are not in the business of harvesting CVs. Important: We will interpret your application as being permission to submit your CV to this role (with the right to represent you) unless you advise us to the contrary.",
      "company": "Triumph Consultants Ltd",
      "activedate": {
        "start": "2024-04-17T06:28:00Z",
        "end": "2024-05-17T06:28:00Z"
      },
      "location": {
        "location": "Wembley, London, HA9 0FJ",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354161"
    },
    {
      "id": 14354162,
      "title": "Lettings Manager – Property Services",
      "summary": "What's involved with this role: Interim Lettings Manager – Property Services Job Ref: K&C 5247643 Pay Rate: £26.56 per hour PAYE Hours per week: 36 Monday – Friday, normal working hours Role Length: This opening assignment is for 3 months City: Kensington, London Basic DBS disclosure required for this role The primary aim of the Lettings Manager is to manage the lettings’ function, ensuring compliance with policies, procedures & legislation, in delivering an effective empty property management service. Support staff to provide a comprehensive customer focused lettings service and take ownership of monitoring performance in relation to empty properties, service development and improvement. Key Responsibilities: Minimise revenue lost by the organization in respect of empty properties, by working closely with colleagues across the business to continually review and refine the management of empty properties. Ensure that the lettings process is effective and efficient by managing the interface between the Voids, Allocations and Neighbourhoods Teams Ensure that void turnaround targets are met Ensure void status data is accurate and that this is reconciled on One Housing and CRM in a timely manner Work with the Allocations team to support corporate objectives i.e., completion of CORE returns and identifying best practice Work proactively with the Hostels Manager to ensure opportunities for move on accommodation are identified Manage and arrange decants so that residents have certainty on when they can safely return to their homes Identify Voids suitable for decants or transfers as per agreed protocol Ensure that lettings packs are up to date and contain relevant local information Undertake spot checks on empty properties to ensure that a high lettable standard is consistently achieved. Maximise the Council’s revenue through efficient and effective letting of garage stock. Manage and oversee lettings’ process of New Built developments and collaborate with relevant teams to achieve prompt letting and high customer satisfaction Measure, manage and improve performance against corporate targets and service standards in order to ensure compliance with policy and procedure To ensure continuous development of the team through on-going coaching, support and the identification of personal development needs in regular performance & objective reviews. NB: Please feel free to apply to us direct via jobstclrec.com by quoting the job reference and job title exactly. To help speed up the process of uploading your CV to the client we would suggest that you send us your CV in Word format (or equivalent) if possible, rather than as a PDF. If you are successful in securing this role, please note that for the entire duration of this contract, regardless of extension you will be working this role at the PAYE rate that has been advertised. For absolute clarity, we only work on a PAYE basis, rather than entertaining umbrella pay terms, we do not offer Ltd/umbrella or outside IR35 rates. If you wish to understand PAYE vs Umbrella more, please let us know and we can send you some additional information for clarity. Please quote the Job Title & Vacancy Reference No. in your application, or we will be unable to match your CV to the role being applied for. Other “Essential Requirements” – Please check to ensure that your CV addresses the following items: Unless the DBS requirement stated above is for a Basic Disclosure, your DBS must be either through us or be accompanied by a subscription to the DBS updating service. Qualifications: Minimum of 2 A Level passes and 5 GCSE passes (or equivalent) including. English and Maths (A-C grades). Skills & Experience: Minimum of 12 months recent experience in a similar role or context and ideally within a public sector organisation. Proven experience within a customer service environment working for a Housing provider, in a capacity which involved face-to-face interaction with customers, resolving difficult issues and with supervisory or management responsibility. Understanding of the role and scope of Social Housing providers, and access to these services. Comprehensive knowledge of housing law in relation to access to social housing and tenancy law. Proven track record of service redesign and improvement Strong IT skills including Microsoft packages or equivalent (e.g. G Suite). S 1 Job Ref: K&C 5247643 Anticipated Length of Assignment: Unless otherwise stated (we do carry the occasional permanent vacancy) all of our roles are technically temporary, though opening assignments can be and often are, extended by clients on a longer term basis and can sometimes become permanent. Please do try to resist contacting us with requests for progress updates. We really do read every CV sent to us. All applications will be acknowledged by a human, not a robot, provided the job remains live and provided your CV meets the “Essential Requirements” listed. Please note that we do our level best to take down ads as soon as roles have been filled. We are not in the business of harvesting CVs. Important: We will interpret your application as being permission to submit your CV to this role (with the right to represent you) unless you advise us to the contrary.",
      "company": "Triumph Consultants Ltd",
      "activedate": {
        "start": "2024-04-17T06:28:00Z",
        "end": "2024-05-17T06:28:00Z"
      },
      "location": {
        "location": "Kensington, London, W10 5UP",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354162"
    },
    {
      "id": 14354160,
      "title": "Supervisor",
      "summary": "Supervisor Where those who love pizza can be their true self. Proud to be a Top 10 Sunday Times Best Place to Work 2023. Benefits: • Free Food on shift • 50% off food and drink when you’re not working • Wagestream gives you access to up to 40% of your earned wages before payday • Wellbeing Support for you and your family • Referral Bonus of £400 for referring pizza chefs and £1000 for referring managers • Holiday & Sick Pay • Pension & Life Assurance • Learning and Development Opportunities You will play a crucial role in the management team, guiding your team to achieve goals and deliver memorable service. Wherever you are in your leadership journey, we provide training and support for your next confident steps. What you’ll do: • Perform opening and closing daily management duties • Help to guide and motivate the team • Maintain and uphold high standards consistently across quality, safety and food Who you are: • Previous management/supervisory experience in customer facing environment • Experience in opening and closing and daily management duties • Proactive approach to achieving goals and driving service excellence Who we are: Where those who love pizza can be their true self. Proud to be a Top 10 Sunday Times Best Place to Work 2023. We’ve been around since 1965, bringing pizza to the UK and have since grown to a multichannel, international brand. Our people are at the heart of our success and everything we do; we believe you should always be able to express yourself. Inclusivity and respect are at the heart of our business and are valued by our teams, customers, and suppliers. PizzaExpress and Milano is a place where everyone is welcome, and everyone belongs. That’s why we assess each application on the aptitude to do the job and nothing else.",
      "company": "PizzaExpress Restaurants Ltd",
      "activedate": {
        "start": "2024-04-17T06:11:00Z",
        "end": "2024-05-17T06:11:00Z"
      },
      "location": {
        "location": "Oxford, OX2 7BY",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354160"
    },
    {
      "id": 14354159,
      "title": "Kitchen Team",
      "summary": "Kitchen Team Where those who love pizza can be their true self. Proud to be a Top 10 Sunday Times Best Place to Work 2023. Benefits: • Free Food on shift • 50% off food and drink when you’re not working • Wagestream gives you access to up to 40% of your earned wages before payday • Wellbeing Support for you and your family • Referral Bonus of £400 for referring pizza chefs and £1000 for referring managers • Holiday & Sick Pay • Pension & Life Assurance • Pay Rates: during your training, you’ll earn £11.44 per hour. £11.75 - £12.13 (dependent on location) when you've finished your training • Plus Tips - You'll receive tips/Tronc, with a 70:30 split between waiting and non-waiting teams, on top of your wages • Learning and Development Opportunities to invest in you Tronc, or card gratuities, is a fair way to pay gratuities to our teams. All Tronc goes to you, shared between our waiting and back of house teams. You’ll get this at the end of each pay period, along with your normal pay and it’s one of the best perks about working in hospitality. You will be creating the star of the show, our pizza. You’ll prep ingredients and keep our food quality high. Your role will go beyond the kitchen – it’s all about creating an enlivening experience for our customers and making every bite memorable. Just be yourself, and we'll bring out the best in you. What you’ll do: • Food prep and dough management • Cook our iconic pizza and pasta • Work in a dynamic and energetic environment Who we are: Where those who love pizza can be their true self. Proud to be a Top 10 Sunday Times Best Place to Work 2023. We’ve been around since 1965, bringing pizza to the UK and have since grown to a multichannel, international brand. Our people are at the heart of our success and everything we do; we believe you should always be able to express yourself. Inclusivity and respect are at the heart of our business and are valued by our teams, customers, and suppliers. PizzaExpress and Milano is a place where everyone is welcome, and everyone belongs. That’s why we assess each application on the aptitude to do the job and nothing else.",
      "company": "PizzaExpress Restaurants Ltd",
      "activedate": {
        "start": "2024-04-17T06:11:00Z",
        "end": "2024-05-17T06:11:00Z"
      },
      "location": {
        "location": "Oxford, OX2 7BY",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354159"
    },
    {
      "id": 14354158,
      "title": "Vision Rehabilitation Worker",
      "summary": "- Suffolk County Council – Endeavour House, Ipswich, IP1 2BX - Community based - £32,076 - £38,223 per annum (pro rata if part time) - 37 hours per week - Flexible working options available - Permanent Sensing Change is a team within Adult Social Care, Suffolk County Council. We provide a range of services to people with sight and/or hearing loss throughout Suffolk, which include Vision Rehabilitation, Social Work & Assessment and a Sensory Support Service. Sensing Change is a well-established, dedicated and supportive team with lots of experience, enthusiasm and passion for promoting the needs of people with sight and/or hearing loss. We will nurture and develop your existing skills providing additional training when needed in this interesting and specialist area of work. Sensing Change is passionate about improving outcomes for people with sight and/or hearing loss throughout Suffolk. If you are too, join us as a qualified Vision Rehabilitation Worker and help us to make a meaningful impact on peoples lives. Your innovation and drive will be supported by this experienced and knowledgeable team. Your role and responsibilities You will - be responsible for assessing, planning and delivering high level independence skills, including orientation and mobility training to people with sight loss or dual sensory loss - offer information, advice, guidance and support to enable people with sight loss to live as independently as possible - balance needs and risk of individuals and you will do this while focussing on promoting independence and positive outcomes - support individuals, carers and their families and work alongside colleagues within Sensing Change and Adult Social Care, as well as partner organisations when required. You will need - Must have Degree/BTEC Diploma in Rehabilitation Studies Level 5 You can view a full list of requirements in the Job and Person Profile (docx). If you believe you can succeed in this role, apply. We would appreciate the opportunity to consider your application. The team Sensing Change is a team of 25 staff, all of whom have a wealth of knowledge and experience and there is always someone available to provide support and share skills. Our main bases are in Ipswich and Lowestoft, but we cover the whole of Suffolk, so this would be flexible. We work in a hybrid way, mixing office, community and home working to suit our workload. Our aim is to focus on early intervention and prevention, enabling individuals to maintain and increase their independence, as well as providing longer support where needed. We have 5 Qualified Vision Rehabilitation Workers and 3 Vision Independence Practitioners. We are excited to welcome someone to join this dedicated team and work alongside us to empower our customers. Empowering Everyone We’re big believers in potential, possibility and the power of different ideas. We’re always searching for ways to encourage, respect and enable everyone to be the best they can be. We aim to include all communities we serve in our representation. To achieve this, we encourage applications from everyone. For more information Please contact Caroline Carr (Head of Service) or Sandi Coleman (Senior Vision Rehabilitation Worker) for a casual conversation. You can reach them by calling (01473) 260030 or emailing infosensingchange.org.uk. How to apply Step 1: Read the Job and Person Profile (docx) before applying for this job opportunity. Step 2: Write a supporting statement indicating how you meet each of the criteria in the ‘Person Profile’ section of the JPP. - You should use the Supporting Statement template. - Please use Arial font size 11 and keep your statement to a maximum of two sides of A4. Step 3: Click ‘Apply Now’ to start your online application. Upload your supporting statement and a copy of your CV (without name and personal details) on the final page. Please note: Without a supporting statement and CV, your interest will not be progressed. If you would like an adjustment to this process, please contact us at 03456 014412 or recruitmentsuffolk.gov.uk. Closing date: 11.30pm, 29th April 2024. Interview date: To be confirmed. This authority is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment. DBS (Disclosure and Barring Service) checks or police vetting will be required for relevant posts. LI-Hybrid As a modern and effective council, we offer a wide variety of careers to suit people with a range of skills, abilities and ambitions. We offer working options that flex to reflect the way people work today and take the time to understand and support your individual needs. We’re driven to make a positive difference to the world around us and encourage everyone with drive and focus to join us and build an influential and impactful career. Reimagine the possibilities. In return, you’ll enjoy: up to 29 days annual leave entitlement (pro rata), plus UK bank holidays and two paid volunteering days membership of a competitive Local Government Pension Scheme (LGPS) travel, lifestyle, health and wellbeing benefits performance-related annual pay progression, in addition to an annual cost-of-living pay increase training and encouragement to expand your knowledge a variety of career development opportunities across our organisation diverse and active staff networks flexible working options, with the right to request flexible working from your first day plus more If you would like to know more about our benefits, values and equality commitments please visit our Working for Suffolk County Council pages (www.Suffolk.gov.uk/careers).",
      "company": "Suffolk County Council",
      "activedate": {
        "start": "2024-04-17T06:08:00Z",
        "end": "2024-05-17T06:08:00Z"
      },
      "location": {
        "location": "Ipswich, Suffolk, IP1 2BX",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354158"
    },
    {
      "id": 14354157,
      "title": "SLA12805 - Head Teacher - Blacklaw Primary School, East Kilbride - SLA12805",
      "summary": "Job Description About the School: Blacklaw Primary opened in 1969 and over the past 54 years we have gained a reputation for providing a quality education through a broad based curriculum, delivered by a team of highly committed professional staff using the most appropriate of resources and teaching methodologies. We have a very happy, caring and friendly atmosphere in our school and everyone works hard to foster and maintain the school’s warming, caring and welcoming ethos. We believe that, working together, we will provide opportunities for all members of our community to achieve their full potential and experience success. Our school values put children at the HEART of all the work we do. We strive to be Honest, Encourage and nurture, Always friendly, Respectful and Resilient and work as a Team. Our aim is to work together, as a school community, to achieve the best outcomes for all learners, providing an engaging environment where pupils are encouraged, supported, and challenged appropriately. Our priority is to create a safe environment where better relationships lead to better learning and, in turn, better behaviour. We promote pupil leadership in classrooms and in the wider school life and are sensitive and responsive to the wellbeing of each child. We have an active Parent Council who are play a vital role in the life of the school. In session 2022/2023, they were proactive in raising funds for our pupils to contribute to the enjoyment of life at Blacklaw. We have strong community links, particularly with our local library and primary schools within the Calderglen Learning Community. Most of our pupils move on to Calderglen High School after P7. We have built solid partnerships with Calderglen to ensure successful transitions School website: Home | Blacklaw Primary School (blacklaw-pri.s-lanark.sch.uk) Requirements Please Apply online All correspondence will be via your email address registered with myjobscotland. GTC Registration It is a legal requirement for any teacher teaching in a Scottish state school to be registered with GTC Scotland, General Teaching Council (Scotland) Registration. Qualification Holding the Standard for Headship became a prerequisite for teachers taking up their first permanent headteacher post at Local Authority and grant-aided schools in Scotland from 1 August 2020, under Section 28 of the Education (Scotland) Act 2016. For more information please visit https://www.gtcs.org.uk/professional-standards/Standard-headship.aspx Legislative Information This post is excepted in terms of the Rehabilitation of Offenders Act 1974 (Exceptions) Order 2003. This post is considered Regulated Work with Children, under the Protection of Vulnerable Groups (Scotland) Act, 2007. Therefore, it is an offence to apply if you are barred from working with children. Preferred candidates will be required to join the PVG Scheme, or undergo a PVG Scheme Update check, prior to a formal offer of employment being made by South Lanarkshire Council. Please refer to http://www.disclosurescotland.co.uk for further information about the disclosure process and best practice. Foreign Police Check Candidates should be able to detail any gaps in employment and provide a foreign police check where applicable for any periods living or working abroad. Equal Opportunities and Armed Forces Community Covenant South Lanarkshire Council is an Equal Opportunities employer and encourages applications from all members of the community. As a user of the disability confident scheme, we guarantee to interview all disabled applicants who meet the minimum competency/behaviour requirements for the position. South Lanarkshire Council is committed to providing support to members of the armed forces, veterans and their families which is set out in the Armed Forces Community Covenant. Veterans are guaranteed an interview who meet the minimum requirements for the position. The Individual Transforming learning and teaching, inspiring learners, improving attainment and supporting young people to achieve their potential is what we want our schools to achieve. We are looking to appoint an experienced and highly motivated leader who can take forward the Council’s priorities for education and the drivers of change in the National Improvement Framework. You can do this as a Head Teacher in one of our modern school buildings which are designed to deliver a 21st century curriculum. We are looking to appoint a Head Teacher who is required to: Manage the affairs of the school to the benefit of the pupils and the wider community in compliance with the requirements of the statutes relating to the provision of education and the general duty of care owed to staff and pupils. Formulate clear aims for the school and policies to ensure their achievement within the framework of the Council’s policies. Ensure the communication of these aims and policies to all staff, pupils, parents and other users of the school. Act on behalf of the Council, as principal professional adviser to the Parent Council which is a separately constituted group to support parental engagement, family learning, and provide such advice and information as required, by the Parental Involvement Act 2006.\n\n\nProud member of the Disability Confident employer scheme",
      "company": "South Lanarkshire Council",
      "activedate": {
        "start": "2024-04-17T06:06:00Z",
        "end": "2024-05-17T06:06:00Z"
      },
      "location": {
        "location": "East Kilbride, G74 2BP",
        "city": "",
        "area": "",
        "postcode": "",
        "country": ""
      },
      "link": "https://findajob.dwp.gov.uk/details/14354157"
    }
  ]
  